app/controllers/api/creators_controller.rb

  def index
    @creators = Creator.all
---
SELECT "creators".* FROM "creators"

  def show
    @creator = Creator.with_attached_image.find_by(id: params[:id])
---
SELECT  "creators".* FROM "creators" WHERE "creators"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
    @creator = Creator.create!(creator_params)
---
INSERT INTO "creators" ("creator_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["creator_name", "test"], ["created_at", "2019-05-11 23:03:52.533897"], ["updated_at", "2019-05-11 23:03:52.533897"]]

  def update
    @creator = Creator.find_by(id: params[:id])
    @creator.update(params.require(:creator).permit(:trending))
---
SELECT  "creators".* FROM "creators" WHERE "creators"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "creators" SET "trending" = ?, "updated_at" = ? WHERE "creators"."id" = ?  [["trending", 1], ["updated_at", "2019-05-13 02:50:14.028433"], ["id", 1]]