app/controllers/api/users_controller.rb

  def create
    @user = User.create!(user_params)
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "asda"], ["email", "asda@gmail.com"], ["created_at", "2019-05-09 16:31:23.294498"], ["updated_at", "2019-05-09 16:31:23.294498"]]